Revit 2026 API

# RebarFreeFormAccessorSetCurves(IListIListCurve) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarFreeFormValidationResult SetCurves(
	IList<IList<Curve>> curves
)
```
```vb
Public Function SetCurves (
	curves As IList(Of IList(Of Curve))
) As RebarFreeFormValidationResult
```
```cpp
public:
RebarFreeFormValidationResult SetCurves(
	IList<IList<Curve^>^>^ curves
)
```
```fsharp
member SetCurves :
        curves : IList<IList<Curve>> -> RebarFreeFormValidationResult
```

#### Parameters

curves IListIListCurve

#### Return Value

RebarFreeFormValidationResult

#### Reference

RebarFreeFormAccessor Class

SetCurves Overload

Autodesk.Revit.DB.Structure Namespace